OdRxValue.serializeIn(System.Void!System.Runtime.CompilerServices.IsConst*,System.UInt64)
\details
Reads the value from the byte array.
\param pBytes        [out] Pointer to the byte array.
\param maxBytesToRead [in] Maximum number of the bytes to read.
\returns
Actual number of the bytes read.

OdRxValue.serializeOut(System.Void*,System.UInt64*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Stores the value in the byte array.
\param pBytes         [out] Pointer to the byte array.
\param maxBytesToWrite [in] Maximum number of the bytes to write.
\returns
Actual number of the bytes written.

OdRxValue.getEnumTag
\details
Gets the corresponding descriptor, if this value contains an enumeration
item.
\returns
Enumeration item descriptor.

OdRxValue.unbox(OdRxObject*)
\details
Unwraps RxValue contained in OdRxBoxedValue.
\param pO [in] OdRxBoxedValue to be unboxed.
\returns
Unwrapped value.

OdRxValue.unbox(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Unwraps RxValue contained in OdRxBoxedValue.
\param pO [in] OdRxBoxedValue to be unboxed.
\returns
Unwrapped value.

OdRxValue.typePath
\details
Retreives an ANSI string in format of path that elaborates the sense of
value of the value type. Can be interpreted additionally when working with
RxValue.
\returns
ANSI string with clarification of value sense.

OdRxValue.op_Inequality(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Negative comparison operator.
\param value [in] Value to compare with the current value.
\returns
true if values are not equal; false otherwise.

OdRxValue.op_Equality(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator.
\param value [in] Value to compare with the current value.
\returns
true if values are equal; false otherwise.

OdRxValue.toString(OdRxValueType.StringFormat)
\details
Converts the value to a string.
\param format [in] Defines the format of the resulting string.
\returns
Converted value.
\remarks
Mostly for debug purposes.

OdRxValue.varies
\details
Returns singleton, representing undefined value.
\returns
Singleton, representing undefined value.

OdRxValue.isVaries
\details
Checks whether the value is undefined. This is represented by assigning a
special singleton value "varies".
\returns
true if the value is undefined; false otherwise.

OdRxValue.empty
\details
Returns canonical empty value.
\returns
Canonical empty value.

OdRxValue.isEmpty
\details
Checks if the value is empty.
\returns
true if the value is empty; false otherwise.

OdRxValue.type
\details
Gets the metaclass describing the C++ type of the stored value.
\returns
Metaclass describing the C++ type of the stored value.

OdRxValue.Dispose
\details
Destroys objects of the OdRxValue class.

OdRxValue.op_Assign(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator.
\param rhs [in] Value to be assigned.

OdRxValue.#ctor(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copy constructor for objects of the OdRxValue class. Clones an existing
instance of the OdRxValue class.
\param rhs [in] Object of the OdRxValue class to be cloned.

OdRxValue.#ctor
\details
Default constructor. Creates an OdRxValue instance.